000_OrgFiles/EmacsTestConfig.org
#+TITLE: Personal Emacs Test Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ../C01_EmacsConfiguration/.emacs-test/init.el :mkdirp yes
#+STARTUP: hideblocks show2levels

* Personal Emacs Configuration

The following variables are used to tweak some of the configuration pieces for use in the live streams so you might need to adjust them for your local machine if you try to use this configuration directly.

#+begin_src emacs-lisp

  ;;   _____ __  __    _    ____ ____  
  ;;  | ____|  \/  |  / \  / ___/ ___| 
  ;;  |  _| | |\/| | / _ \| |   \___ \ 
  ;;  | |___| |  | |/ ___ \ |___ ___) |
  ;;  |_____|_|  |_/_/   \_\____|____/ 
  ;;                                   

  ;; NOTE: init.el is generated from EmacsTestConfig.org.
   ;; Please change your settings in that file
   ;; using Emacs and init.el will be generated automatically!

#+end_src


** Setting Up Needed Variables

#+begin_src emacs-lisp
  ;; Setting Variables
  ;; for better customization and readability

  ;; Save Dotfiles Dirs for later use
  (setq pet/dotfiles-dir
        (expand-file-name
         (convert-standard-filename
         "~/.dotfiles/")))
  (setq pet/dotfiles-emacsconfig-dir
          (concat pet/dotfiles-dir
           "C01_EmacsConfiguration/"))

  ;; Adjust font size to match your system
  (defvar pet/default-font-size 140)
  (defvar pet/default-variable-font-size 120)

#+end_src

* Package System Setup

Emacs has a built in package manager but it doesn't make it easy to automatically install packages on a new system the first time you pull down your configuration.  [[https://github.com/jwiegley/use-package][use-package]] is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

We also use ~straight.el~ to manage our packages instead of ~package.el~, because it allows for more detailed customization and enables more streamlined installation of packages from ~github~ or ~gitLab~, that are not yet part of *elpa* or *melpa*.
The *bootstrap* script is needed to install straight.el without the need for package.el. It should work cross platform without the need to update anytime soon. It's recommended by the authors to use. If straight.el is already installed, the script won't run again!
A guide from ~System Crafters~ to =straight.el= can be found [[https://systemcrafters.cc/advanced-package-management/using-straight-el/][here]].

If you set up ~straight.el~ with ~use-package~ (straight-use-package 'use-package) you have to replace =:ensure= with =:straight=

#+begin_src emacs-lisp

  ;; bootstrap script to install straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Use straight.el for use-package expressions
  (straight-use-package 'use-package)

  ;; Make sure to always install packages (pendant to use-package-always-ensure)
  (setq straight-use-package-by-default t)

#+end_src

* Basic UI Configuration

This section configures basic UI settings that remove unneeded elements to make Emacs look a lot more minimal and modern.  If you're just getting started in Emacs, the menu bar might be helpful so you can remove the =(menu-bar-mode -1)= line if you'd like to still see that.

#+begin_src emacs-lisp
  ;; A few basic settings

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room

  (menu-bar-mode -1)          ; Disable the menu bar

  ;; Start Emacs in Fullscreen mode
  (add-hook 'emacs-startup-hook 'toggle-frame-maximized)

  ;; Set default Encoding to UTF-8
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8)

  ;; Set up the visible bell
  (setq visible-bell t)

  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  treemacs-mode))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Font Configuration

These ~Fonts~ are using the =pet/default-font-size= variable defined earlier
#+begin_src emacs-lisp

  ;; Set default font face
  (set-face-attribute 'default nil :font "Iosevka" :height pet/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "Iosevka" :height pet/default-font-size)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "Cantarell" :height pet/default-font-size :weight 'regular)

#+end_src

* Quality of Live Adjustments

** Keeping Folders Clean
*** Backup Files

:NOTE:
Can't seem to get these settings to work, need to look into it further
:END:

~Backup Files~ are files with a ="\~"= at the end: =Emacs.org~=
First we are gonna set the the directory for our backup files, to store them in a single place instead of all over the system
More info here: [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Backup.html]]

#+begin_src emacs-lisp
  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
#+end_src

*** Auto Save Files

~Auto Save Files~ are files with ="#"= on both ends: like =#Emacs.org#=. Next we are gonna save auto save files to a centralized location
#+begin_src emacs-lisp
  ;; auto-save-mode doesn't create the path automatically!
  (make-directory (expand-file-name "tmp/auto-saves" user-emacs-directory) t)
  
  ;; default for auto-save-list-file-prefix is "~/.emacs.d/auto-save-list/.saves~"
  ;; this moves it to a more centralized location (tmp)
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))
#+end_src

** Calender

#+begin_src emacs-lisp

  ;; Show Calendar on StartUp                      
  (calendar)

  ;; set date format to %DD-%MM-%YYYY
  (setq european-calender-style 't)

#+end_src

** Macros

#+begin_src emacs-lisp

    ; Setup file containing global macros
    (load-file
     (concat pet/dotfiles-emacsconfig-dir
             "macros/global.macs")) 

    ;; Set of keybindings for defined macros
    ;; Make sure to have a definition of the macro in your /macros folder
    (global-set-key "\C-x\C-kT" 'transpose-names)

#+end_src
** Booksmarks

Setup a location for your bookmarks-file

#+begin_src emacs-lisp
  ;; Set Location for bookmarks file/s
  (setq bookmark-default-fil
        (concat pet/dotfiles-emacsconfig-dir
                "bookmarks"))
#+end_src

** Abbreviations

#+begin_src emacs-lisp

  ;; Activate Abbrev Mode by default
  (setq-default abbrev-mode t)

  ;; Set Location and Name of Abbrev file
  (setq abbrev-file-name
        (concat pet/dotfiles-emacsconfig-dir
                "abbrev_defs"))

  ;; Save Abbrevs when saving Files
  (setq save-abbrevs t)

#+end_src

** YASnippets

Load ~package~ =yasnippets= (should already come preinstalled, invocation is just to do the configuration)
Set the folder for snippets to be saved
Enable YASnippets globally
Documentation can be found here: [[https://github.com/joaotavora/yasnippet]]

#+begin_src emacs-lisp
  (setq pet/yasnippet-dir
        (concat pet/dotfiles-emacsconfig-dir
                "snippets"))

  ;; Yasnippets
  (use-package yasnippet
    :config
    ;; Set Yasnippet dir
    (setq yas-snippet-dirs '(pet/yasnippet-dir))

    ;; Activate Yasnippets globally
    (yas-global-mode 1)

    ;; Enable snippets being shared between modes
    (add-hook 'yas-minor-mode-hook
              (lambda ()
                (yas-activate-extra-mode
                 'fundamental-mode))))

#+end_src

** Multiple Cursors

~Multiple Cursors~ are a must for *modern editors*.
Obviously [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] has a package for that too:
#+begin_src emacs-lisp
  ;; Multiple cusors are a must. Make <return> insert a newline; multiple-cursors-mode can still be disabled with C-g.
  (use-package multiple-cursors
    :config
    (setq mc/always-run-for-all 1)
    (global-set-key (kbd "C-S-c C-S-c")
                    'mc/edit-lines)
    (global-set-key (kbd "C-<")
                    'mc/mark-previous-like-this)
    (global-set-key (kbd "C->")
                    'mc/mark-next-like-this)
    (global-set-key (kbd "C-c M-<")
                    'mc/mark-all-like-this)
    (global-set-key (kbd "s-D")
                    'mc/mark-all-dwim)
    (define-key mc/keymap (kbd
                           "<return>") nil))
#+end_src

* Keybinding Configuration

 [[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with =which-key=.

#+begin_src emacs-lisp
  ;; Setup general for easier key config
  (use-package general
    :config
    (general-create-definer pet/leader-keys
    :prefix "C-."
    :global-prefix "C-.")

    (pet/leader-keys
     "t"  '(:ignore t :which-key "toggles")
     "tt" '(counsel-load-theme
            :which-key "choose theme")))
#+end_src

* Extended UI Configuration
** Command Log Mode

[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame.  Great for live streams and screencasts!

#+begin_src emacs-lisp
  ;; Enable Command Log Mode
  (use-package command-log-mode)
#+end_src

