000_OrgFiles/EmacsTestConfig.org
** Doom Themes

[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp
  ;; Load Doom Themes
  (use-package doom-themes
    ;; :init (load-theme 'doom-dracula t)
    )
#+end_src

** Doom Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]].  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

:NOTE:
The *first time* you load your configuration on a *new machine*, you'll need to run =M-x all-the-icons-install-font= so that mode line icons display correctly.
:END:

#+begin_src emacs-lisp
  ;; Use all-the-icons
  ;;required for doom modeling
  (use-package all-the-icons)

  ;; Load doom modeline
  (use-package doom-modeline
    ;; Activate Doom Modeline
    ;; :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))
#+end_src

** Which Key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp
  ;; Load which-key
  ;; Loads a more helpful UI Completion buffer 
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))
#+end_src

** Tab Bar Mode

Here we configure =Tab Bar Mode= to work in a specific way.
First we want new tabs to always open with a *scratch* buffer

:NOTE:
=Tab Bar Mode= was added in ~Emacs 27~
:END:
#+begin_src emacs-lisp
  ;; Tab Bar Mode Setting

  ;; Set new tab to scratch buffer
  (setq tab-bar-new-tab-choice "*scratch*")
  ;; right is default -
  ;; change if you dont like that
  ;; (tab-bar-new-tab-to right)                

  ;; Set the name of the tab to
  ;; match the current buffer
  ;; (setq tab-bar-tab-name-function
  ;;       tab-bar-current-tab-name)

    ;; Keyboard Rules
    ;; Remove Tab Bar Buttons
    (setq tab-bar-close-button-show nil
          tab-bar-new-button-show nil
          ;; tab-bar-button-relief               ;; controls outline of buttons
          ;; tab-bar-face tab-bar-tab            ;; configure tab face (bgcolor etc.)
          )

    ;; tab bar is not automatically shown
    ;; (set 1 to enable)
    (setq tab-bar-show nil)                      

    ;; Helper function to get only the name
    ;; of current tab
    (defun pet/current-tab-name ()
      (alist-get 'name (tab-bar--current-tab)))
#+end_src

** Treemacs Mode

=Treemacs= is a handy tree-style *file directory viewer* that's very similar to what you are used from commercial IDEs.
It's got good integration with =Projectile=

#+begin_src emacs-lisp
  (use-package treemacs
    :bind
    (:map global-map
          ([f8] . treemacs)
          ("C-<f8>" . treemacs-select-window))
    :config
    ;; ensure that treemacs-buffer is
    ;; ignored when switching windows 
    (setq treemacs-is-never-other-window t)

    ;; Add shortcut for treemacs to
    ;; personal keyspace
    (pet/leader-keys
      "tt" 'treemacs
      "tw" 'treemacs-select-window)
    )
#+end_src

* Elfeed - Emacs RSS Feed

~Elfeed~ is a package, that enables you to see your ~RSS Feed~ in [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]. We also set up ~elfeed-score~
Great inspirations for ~Elfeed~ Configurations can be found here:
- [[https://protesilaos.com/emacs/dotemacs#h:0cd8ddab-55d1-40df-b3db-1234850792ba][Protesilaos.com]]
- [[https://github.com/jkitchin/scimax/blob/master/scimax-elfeed.el][GitHub.com: John Kitchin - Scimax-Elfeed]]
#+begin_src emacs-lisp
  (use-package elfeed
    :bind (("C-c f" . elfeed)
           :map elfeed-search-mode-map
           ("n" . (lambda () (interactive) (next-line) (call-interactively 'elfeed-search-show-entry)))
           ("p" . (lambda () (interactive) (previous-line) (call-interactively 'elfeed-search-show-entry)))
           ("m" . (lambda () (interactive) (apply 'elfeed-search-toggle-all '(star))))
           ("g" . elfeed-update)
           ("G" . elfeed-search-update--force)
           ;;:map elfeed-show-mode-map
           ;;("w" . elfeed-show-yank))
       )
  :config
  (setq elfeed-show-entry-switch 'display-buffer)
  (setq elfeed-search-remain-on-entry t)
   ;; Various Necessary/Helpful Settings
  (setq elfeed-use-curl t)
  (setq elfeed-curl-max-connections 10)
  (setq elfeed-db-directory
        (concat pet/dotfiles-emacsconfig-dir
                "elfeed/"))
  (setq elfeed-enclosure-default-dir
        "~/Downloads/")
  (setq elfeed-search-filter
        "@4-months-ago +unread")
  (setq elfeed-sort-order 'descending)
  (setq elfeed-search-clipboard-type 'CLIPBOARD)
  (setq elfeed-search-title-max-width 150)
  (setq elfeed-search-title-min-width 30)
  (setq elfeed-search-trailing-width 25)
  (setq elfeed-show-truncate-long-urls t)
  (setq elfeed-show-unique-buffers t)
  (setq elfeed-search-date-format
        '("%F %R" 16 :left))

  ;; Snippet for periodic update for feeds
  ;; (3 mins since Emacs start, then every
  ;; half hour)
  (run-at-time 180 1800
               (lambda ()
                 (unless elfeed-waiting
                   (elfeed-update))))
  )
  ;; Load Feeds and Feed Settings  
  (load (concat pet/dotfiles-emacsconfig-dir
                "EmacsRSSFeed.el"))
#+end_src

** Elfeed-Score

~Elfeed-Score~ is a ~package~ that applies [[https://www.gnu.org/software/emacs/manual/html_node/gnus/Scoring.html#Scoring][Gnu-Style Scoring]] to [[id:211d12c6-29db-4550-bd06-ef6f8b32640c][Elfeed]]

#+begin_src emacs-lisp
  ;; Load Elfeed Score
  (use-package elfeed-score
    :config
    (progn
      (elfeed-score-enable)
      (define-key elfeed-search-mode-map "="
                  elfeed-score-map))
    (setq elfeed-search-print-entry-function
          #'elfeed-score-print-entry)
    (setq elfeed-score-serde-score-file
          (concat pet/dotfiles-emacsconfig-dir
           "elfeed.score"))
    (setq elfeed-score-rule-stats-file
          (concat pet/dotfiles-emacsconfig-dir
                  "elfeed.stats")))
#+end_src

* Org Mode

#+begin_src emacs-lisp
  (use-package org
    :bind (("C-c l" . org-store-link))
    :config
    (setq org-ellipsis " ▾")

    (setq org-directory (convert-standard-filename "~/Org"))
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    ;; setup inline previewing of latex fragments
    (setq org-latex-create-formula-image-program 'imagemagick)

    (setq org-agenda-files
          '("~/Org/journal"
            "~/Org/personal-tasks.org"
            "~/Org/personal-mail.org"
            "~/Org/personal-chores.org"))

    )
  #+end_src
  
