C01_EmacsConfiguration/.emacs-test/init.el

;; Load Doom Themes
(use-package doom-themes
  ;; :init (load-theme 'doom-dracula t)
  )

;; Use all-the-icons
;;required for doom modeling
(use-package all-the-icons)

;; Load doom modeline
(use-package doom-modeline
  ;; Activate Doom Modeline
  ;; :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

;; Load which-key
;; Loads a more helpful UI Completion buffer 
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

;; Tab Bar Mode Setting

;; Set new tab to scratch buffer
(setq tab-bar-new-tab-choice "*scratch*")
;; right is default -
;; change if you dont like that
;; (tab-bar-new-tab-to right)                

;; Set the name of the tab to
;; match the current buffer
;; (setq tab-bar-tab-name-function
;;       tab-bar-current-tab-name)

  ;; Keyboard Rules
  ;; Remove Tab Bar Buttons
  (setq tab-bar-close-button-show nil
        tab-bar-new-button-show nil
        ;; tab-bar-button-relief               ;; controls outline of buttons
        ;; tab-bar-face tab-bar-tab            ;; configure tab face (bgcolor etc.)
        )

  ;; tab bar is not automatically shown
  ;; (set 1 to enable)
  (setq tab-bar-show nil)                      

  ;; Helper function to get only the name
  ;; of current tab
  (defun pet/current-tab-name ()
    (alist-get 'name (tab-bar--current-tab)))

(use-package treemacs
  :bind
  (:map global-map
        ([f8] . treemacs)
        ("C-<f8>" . treemacs-select-window))
  :config
  ;; ensure that treemacs-buffer is
  ;; ignored when switching windows 
  (setq treemacs-is-never-other-window t)

  ;; Add shortcut for treemacs to
  ;; personal keyspace
  (pet/leader-keys
    "tt" 'treemacs
    "tw" 'treemacs-select-window)
  )

(use-package elfeed
  :bind (("C-c f" . elfeed)
         :map elfeed-search-mode-map
         ("n" . (lambda () (interactive) (next-line) (call-interactively 'elfeed-search-show-entry)))
         ("p" . (lambda () (interactive) (previous-line) (call-interactively 'elfeed-search-show-entry)))
         ("m" . (lambda () (interactive) (apply 'elfeed-search-toggle-all '(star))))
         ("g" . elfeed-update)
         ("G" . elfeed-search-update--force)
         ;;:map elfeed-show-mode-map
         ;;("w" . elfeed-show-yank))
     )
:config
(setq elfeed-show-entry-switch 'display-buffer)
(setq elfeed-search-remain-on-entry t)
 ;; Various Necessary/Helpful Settings
(setq elfeed-use-curl t)
(setq elfeed-curl-max-connections 10)
(setq elfeed-db-directory
      (concat pet/dotfiles-emacsconfig-dir
              "elfeed/"))
(setq elfeed-enclosure-default-dir
      "~/Downloads/")
(setq elfeed-search-filter
      "@4-months-ago +unread")
(setq elfeed-sort-order 'descending)
(setq elfeed-search-clipboard-type 'CLIPBOARD)
(setq elfeed-search-title-max-width 150)
(setq elfeed-search-title-min-width 30)
(setq elfeed-search-trailing-width 25)
(setq elfeed-show-truncate-long-urls t)
(setq elfeed-show-unique-buffers t)
(setq elfeed-search-date-format
      '("%F %R" 16 :left))

;; Snippet for periodic update for feeds
;; (3 mins since Emacs start, then every
;; half hour)
(run-at-time 180 1800
             (lambda ()
               (unless elfeed-waiting
                 (elfeed-update))))
)
;; Load Feeds and Feed Settings  
(load (concat pet/dotfiles-emacsconfig-dir
              "EmacsRSSFeed.el"))

;; Load Elfeed Score
(use-package elfeed-score
  :config
  (progn
    (elfeed-score-enable)
    (define-key elfeed-search-mode-map "="
                elfeed-score-map))
  (setq elfeed-search-print-entry-function
        #'elfeed-score-print-entry)
  (setq elfeed-score-serde-score-file
        (concat pet/dotfiles-emacsconfig-dir
         "elfeed.score"))
  (setq elfeed-score-rule-stats-file
        (concat pet/dotfiles-emacsconfig-dir
                "elfeed.stats")))

(use-package org
  :bind (("C-c l" . org-store-link))
  :config
  (setq org-ellipsis " ▾")

  (setq org-directory (convert-standard-filename "~/Org"))
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  ;; setup inline previewing of latex fragments
  (setq org-latex-create-formula-image-program 'imagemagick)

  (setq org-agenda-files
        '("~/Org/journal"
          "~/Org/personal-tasks.org"
          "~/Org/personal-mail.org"
          "~/Org/personal-chores.org"))

  )
