C01_EmacsConfiguration/.emacs-test/init.el

;; Org Capture helper Function
(defun pet/create-documents-file ()
  "Create an org file in ~/Org/."
  (interactive)
  (let ((name (read-string "Filename: ")))
    (expand-file-name
     (format "%s.org" name))))

;; Org-Capture
(use-package org-capture
  :straight nil
  :config
   (setq org-capture-templates
         ;; Acronym captures
         `(("a" "Acronyms")

           ("ag" "General Acronyms")
           ("agg" "General Acronyms - General" table-line
            (file+olp "~/Org/acronyms.org" "General"
                      "General")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION}|")
           ("agt" "General Acronyms - Terminology" table-line
            (file+olp "~/Org/acronyms.org" "General"
                      "Terminology")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION}|")

           ("as" "Scientific Acronyms")
           ("ase" "Scientific Acronyms - Economy" table-line
            (file+olp "~/Org/acronyms.org" "Science"
                      "Economy")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION}|")
           ("asg" "Scientific Acronyms - General" table-line
            (file+olp "~/Org/acronyms.org" "Science"
                      "General")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION}|")
           ("asm" "Scientific Acronyms - Maths" table-line
            (file+olp "~/Org/acronyms.org" "Science"
                      "Maths")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION}|")
           ("asp" "Scientific Acronyms - Physics" table-line
            (file+olp "~/Org/acronyms.org" "Science"
                      "Physics")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION}|")

           ("ai" "IT related Acronyms")
           ("aic" "IT related Acronyms - Encryption" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "Encryption")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")
           ("aim" "IT related Acronyms - Mail" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "Mail")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")
           ("aie" "IT related Acronyms - Emacs" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "Emacs")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")
           ("aig" "IT related Acronyms - General" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "General")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")
           ("aii" "IT related Acronyms - Internet" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "Internet")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")
           ("ail" "IT related Acronyms - LaTeX" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "LaTeX")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")
           ("ain" "IT related Acronyms - Networks" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "Networks")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")
           ("aip" "IT related Acronyms - Programming" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "Programming")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")
           ("aiu" "IT related Acronyms - Encoding" table-line
            (file+olp "~/Org/acronyms.org" "IT"
                      "Encoding")
            "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION} |")  


           ;; Documents
           ("d" "Documents")
           ("dl" "Letter")
           ("dlf" "Letter Form" plain (file pet/create-documents-file)
            "%[~/.dotfiles/00_OrgFiles/Templates/Capture-LetterTemp.org]"
            :if-new (file "${slug}.org" "#+TITLE: ${title}\n")
            :unnarrowed t
            )
           ("dlh" "Letter Home" plain (file pet/create-documents-file)
            "%[~/Templates/X1_Emacs_Templates/Capture-LetterTemp-Filled-Home-Real.org]"
            :if-new (file "${slug}.org" "#+TITLE: ${title}\n")
            :unnarrowed t
            )


           ;; Email captures
           ("e" "Email")
           ("em" "Make email note" entry
            (file+headline "~/Org/personal-tasks.org" "Mail correspondence")
            ,(concat "* TODO [#A] %:subject :mail:\n"
                     "SCHEDULED: %t\n:"
                     "PROPERTIES:\n:CONTEXT: %a\n:END:\n\n"
                     "%i%?"))
           ("ef" "Follow Up" entry (file+olp "~/Org/personal-mail.org" "Follow Up")
            "* TODO Follow up with %:fromname on %a\nSCHEDULED:%t\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))\n\n%i \n\n" :immediate-finish t)
           ("er" "Read Later" entry (file+olp "~/Org/personal-mail.org" "Read Later")
            "* TODO Read %:subject %a\nSCHEDULED:%t\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))\n\n%i \n\n" :immediate-finish t)


           ;; Journal captures
           ("j" "Journal Entries")
           ("jj" "Journal" entry
            (file+olp+datetree "~/Org/journal/journal.org")
            "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
            ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
            :clock-in :clock-resume
            :empty-lines 1)
           ("jm" "Meeting" entry
            (file+olp+datetree "~/Org/journal/journal.org")
            "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
            :clock-in :clock-resume
            :empty-lines 1)


           ;; Checklist captures
           ("l" "Lists")

           ("ls" "Shopping List")
           ("lsp" "Permanent & Long Lasting")
           ("lspw" "Living" checkitem
            (file+olp "~/Org/lists-shopping.org" "TODO = Permanentgüter =" "TODO = Wohnung =")
            "%^{Itemname}")
           ("lspd" "Technology" checkitem
            (file+olp "~/Org/lists-shopping.org" "TODO = Permanentgüter =" "TODO = Technik =")
            "%^{Itemname}")
           ("lspdc" "Computer" checkitem
            (file+olp "~/Org/lists-shopping.org" "TODO = Permanentgüter =" "TODO = Wohnung =" "TODO = Computer =")
            "%^{Itemname}")
           ("lspdh" "Appliances" checkitem
            (file+olp "~/Org/lists-shopping.org" "TODO = Permanentgüter =" "TODO = Wohnung =" "TODO = Haushaltsgeräte =")
            "%^{Itemname}")
           ("lspt" "Transport" checkitem
            (file+olp "~/Org/lists-shopping.org" "TODO = Permanentgüter =" "TODO = Transport =")
            "%^{Itemname}")
           ("lsv" "Consumables & Usables")
           ("lsvb" "Office Supplies" checkitem
            (file+olp "~/Org/lists-shopping.org" "TODO = Verbrauchsgüter =" "TODO = Büromaterial =")
            "%^{Itemname}")
           ("lsvl" "Groceries" checkitem
            (file+olp "~/Org/lists-shopping.org" "TODO = Verbrauchsgüter =" "TODO = Lebensmittel =")
            "%^{Itemname}")
           ("lsvr" "Cleaning Supplies" checkitem
            (file+olp "~/Org/lists-shopping.org" "TODO = Verbrauchsgüter =" "TODO = Reinigungs- und Pflegemittel =")
            "%^{Itemname}")

           ("ll" "Literature")
           ("lls" "Scientific Literature")
           ("llsb" "Biology" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Philosophie und Soziologie ==") "[ ] %^{Author} - %^{Title}")
           ("llsc" "Chemistry" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Chemie ==") "[ ] %^{Author} - %^{Title}")
           ("llse" "Politics, Economy and Ecology" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Politik, Ökonomie und Ökologie ==") "[ ] %^{Author} - %^{Title}")
           ("llsg" "History" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== History ==") "[ ] %^{Author} - %^{Title}")
           ("llsh" "Medicine and Health" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Medizin ==") "[ ] %^{Author} - %^{Title}")
           ("llsi" "IT" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Informatik, Data-Science und AI ==") "[ ] %^{Author} - %^{Title}")
           ("llsm" "Maths" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Mathematik ==") "[ ] %^{Author} - %^{Title}")
           ("llsp" "Physics" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Physik ==") "[ ] %^{Author} - %^{Title}")
           ("llss" "Philosophy and Sociology" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Philosophie und Soziologie ==") "[ ] %^{Author} - %^{Title}")
           ("llst" "Technology" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Technik ==") "[ ] %^{Author} - %^{Title}")
           ("llsl" "Languages" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Sprachen ==") "[ ] %^{Author} - %^{Title}")
           ("llsz" "Psychology" checkitem
            (file+olp "~/Org/lists-literature.org" "= Sachbücher =" "== Psychologie ==") "[ ] %^{Author} - %^{Title}")

           ("llr" "Novels" checkitem
            (file+olp "~/Org/lists-literature.org" "= Romane =") "[ ] %^{Author} - %^{Title}")
           ("llrk" "Classics" checkitem
            (file+olp "~/Org/lists-literature.org" "= Romane =" "== Klassiker ==") "[ ] %^{Author} - %^{Title}")


           ("lm" "Music")
           ("lmd" "Downlaodable" checkitem
            (file+olp "~/Org/lists-music.org" "TODO Musik zum Downloaden")
            "[ ] %^{Interpret} - %^{Title}")

           ("q" "Quotes")
           ("qt" "Talks" entry
            (file+olp "~/Org/personal-quotes.org" "Reden und Interviews")
            "* %^{Originator} \n %?")
           ("ql" "Literature" entry
            (file+olp "~/Org/personal-quotes.org" "Literatur")
            "* %^{Originator} \n %?")


           ("t" "Tasks / Projects")
           ("tt" "TODO Task" entry (file+olp "~/Org/personal-tasks.org" "Inbox")
            "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)  
           ("tb" "Basic task for future review" entry
            (file+headline "~/Org/personal-tasks.org" "Inbox")
            ,(concat "* %^{Title}\n"
                     ":PROPERTIES:\n"
                     ":CAPTURED: %U\n"
                     ":END:\n\n"
                     "%i%l"))
           ("ts" "Task with a due date (scheduled)" entry
            (file+headline "~/Org/personal-tasks.org" "Inbox")
            ,(concat "* %^{Scope of task||TODO|STUDY|MEET} %^{Title} %^g\n"
                     "SCHEDULED: %^t\n"
                     ":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"
                     "%i%?"))
           ("td" "Task with a due date (deadline)" entry
            (file+headline "~/Org/personal-tasks.org" "Inbox")
            ,(concat "* %^{Scope of task||TODO|STUDY|MEET} %^{Title} %^g\n"
                     "DEADLINE: %^t\n"
                     ":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"
                     "%i%?"))


           ("w" "Workflows")
           ("we" "Checking Email" entry (file+olp+datetree "~/Org/journal/Journal.org")
            "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)))


  (setq org-capture-templates-contexts
        '(("e" ((in-mode . "notmuch-search-mode")
                (in-mode . "notmuch-show-mode")
                (in-mode . "notmuch-tree-mode")
                (in-mode . "mu4e-headers-mode")))))
  :bind
  ("C-c c" . org-capture))
