C01_EmacsConfiguration/.emacs-test/init.el

(with-eval-after-load 'ox-latex
(add-to-list 'org-latex-classes
             '("org-plain-latex"
               "\\documentclass{article}
                \\usepackage{hyperref}
                \\usepackage{babel}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(add-to-list 'org-latex-classes
           '("org-plain-scrlttr2-german"
             "\\documentclass[a4paper, 
              parskip=half,%
              fromalign=right, 
              fromrule=false, 
              11pt, ngerman]{scrlttr2}
              \\usepackage{hyperref}
              \\usepackage{babel}
         [NO-DEFAULT-PACKAGES]
         [PACKAGES]
         [EXTRA]"
             ("\\section{%s}" . "\\section*{%s}")
             ("\\subsection{%s}" . "\\subsection*{%s}")
             ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
             ("\\paragraph{%s}" . "\\paragraph*{%s}")
             ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

;; Bigger LaTeX Previews
(plist-put org-format-latex-options :scale 1.5)
;; Load language packages for pdflatex of lualatex / xelatex compilers
;; (add-to-list 'org-latex-packages-alist
;;              '("AUTO" "babel" t ("pdflatex")))
;; (add-to-list 'org-latex-packages-alist
;;              '("AUTO" "polyglossia" t ("xelatex" "lualatex")))
)

(use-package org-roam
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/Org")
  (org-roam-dailies-directory "journal/")

  (org-roam-completion-everywhere t)

  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n I" . org-roam-node-insert-immediate)
         :map org-mode-map
         ("C-M-i"    . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
      ;; org roam capture templates
  (setq org-roam-capture-templates
        `(("d" "default" plain
          "%?"
          :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n#+DATE: %U\n")
          :unnarrowed t)
          ("l" "programming language" plain
           "* Characteristics\n\n- Family: %?\n- Inspired by: \n\n* Reference:\n\n"
           :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n")
           :unnarrowed t)  
          ("b" "book notes" plain (file "~/.dotfiles/00_OrgFiles/Templates/RoamCapture-BookNoteTemp.org")
           :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n")
           :unnarrowed t)
          ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
           :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n#+filetags: Project")
           :unnarrowed t)
          ))


  ;; dailies capture template
  (setq org-roam-dailies-capture-templates
        `(("d" "default" entry "* %<%I:%M %p>: %?"
           :if-new (file+head "%<%Y-%m-%d>.org" "#+TITLE: %<%Y-%m-%d>\n"))))

  (org-roam-setup)
  (require 'org-roam-dailies) ;; Ensure the keymap is available
  (org-roam-db-autosync-mode))

(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (push arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))

(use-package org-drill
  :config
  (progn
    (add-to-list 'org-modules 'org-drill)
    (setq org-drill-add-random-noise-to-intervals-p t)
    (setq org-drill-hint-separator "||")
    (setq org-drill-left-cloze-delimiter "<[")
    (setq org-drill-right-cloze-delimiter "]>")
    (setq org-drill-learn-fraction 1.0))
  )

;; Setup Automatic Tangling of Files

;; Automatically tangle config file
;; Helper Function to that does the tangling
(defun pet/org-babel-tangle-config ()
  (when (string-equal
         (buffer-file-name)
         (concat pet/dotfiles-dir
                 "000_OrgFiles/EmacsTestConfig.org"))

    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

;; This hook automatically evaluates the helper
;; function after saving the buffer
(add-hook 'org-mode-hook
          (lambda ()
            (add-hook
             'after-save-hook
             #'pet/org-babel-tangle-config)))

;; Automatically tangle test config file
;; Helper Function to that does the tangling
(defun pet/org-babel-tangle-testconfig ()
  (when (string-equal
         (buffer-file-name)
         (concat pet/dotfiles-dir
                 "000_OrgFiles/EmacsTestConfig.org"))
      (org-babel-tangle)))

;; This hook automatically evaluates the helper
;; function after saving the buffer
(add-hook 'org-mode-hook
          (lambda ()
            (add-hook
             'after-save-hook
             #'pet/org-babel-tangle-testconfig)))

;; Setup Automatic Tangling of Files

;; Automatically tangle config file
;; Helper Function to that does the tangling
(defun pet/org-babel-tangle-feeds ()
  (when (string-equal
         (buffer-file-name)
         (concat pet/dotfiles-dir
                 "000_OrgFiles/EmacsRSSFeed.org"))

    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

;; This hook automatically evaluates the helper
;; function after saving the buffer
(add-hook 'org-mode-hook
          (lambda ()
            (add-hook
             'after-save-hook
             #'pet/org-babel-tangle-feeds)))
